"""
รับข้อมูลเข้ามา ตั้งชื่อตัวแปรว่า val โดยทำการทดสอบโดยกรอก 50 เข้าไป
"""


"""
แปลงค่าจาก val เป็น int แล้วเก็บไว้ในตัวแปร val 
"""


"""
ตรวจว่าชนิดตัวของ val ว่าคือชนิดอะไร แล้วแสดงผลออกมา
"""


"""
ทำการคำนวณ โดยให้ val บวกเท่ากับ ((((val บวก 50) ยกกำลัง 2 - 23) หารปัดเศษ 52 คูณ 7 ) % 2)
"""

val = 50
val += (((val + 50) ** 2 - 23) // 52 * 7) % 2

"""
แสดงผลออกมาแล้วตรวจว่า val มีค่ามากกว่าหรือเท่ากับ 50 หรือเปล่า
"""


"""
แสดงผลออกมาแล้วตรวจว่า val มีค่ามากกว่าหรือเท่ากับ 60 หรือเปล่า
"""


"""
แสดงผลข้อมูล val โดยให้จัดรูปแบบสตริงให้เป็นตัวอย่างแบบนี้ "ผลลัพธ์ที่ได้ 51 แบบ" โดย 51 แทนตัวแปร val
"""
